Revit 2026 API

# CutLineType Enumeration

---

The available line types for a stairs cut line.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CutLineType
```
```vb
Public Enumeration CutLineType
```
```cpp
public enum class CutLineType
```
```fsharp
type CutLineType
```

| Member name | Value | Description |
| --- | --- | --- |
| DoubleLine | 1 | Cutline type is double-line. |
| SingleLine | 0 | Cutline type is single-line. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace